{
    "basics": {
        "label": "Software Developer",
        "summary": "I am a software engineer with a mathematics and physics background and a passion for learning. Problem solver and technology enthusiast, always looking for ways to improve my craft whilst enjoying the chance to work with talented and creative people."
    },
    "interests": [
        {
            "name": "Amateur Astronomy"
        },
        {
            "name": "Comic Books"
        }
    ],
    "work": [
        {
            "company": "Throughtek",
            "summary": "The is a game company. Developed software for the mobile wireless and big data processing field of retail banking and mobile games.",
            "website": "http://throughtek.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "Implemented a system to invoice customers, and provided support and product audit."
            ]
        },
        {
            "company": "Byggmann Gruppen As",
            "summary": "is a software company whose focus is on delivering top notch web and mobile applications to our clients",
            "website": "http://byggmann-gruppen-as.com",
            "position": "Senior Software Engineer, Corporate Applications",
            "highlights": [
                "built content / management systems for service platform to call center use"
            ]
        },
        {
            "company": "(no Trading)",
            "summary": "Is a technology platform for online sports information. It has created, efficient, maintenance, issue and electronic medical facilities based on call management support. Primary technologies were for the services of the Linux system, and helped distribute into a highly asset tracking and changes.",
            "website": "http://no-trading.com",
            "position": "Senior Systems Engineer"
        },
        {
            "company": "Rocketfuel Studios",
            "summary": "is a software company whose focus is on delivering top notch web and mobile applications to our clients",
            "website": "http://rocketfuel-studios.com",
            "position": "Senior Software Engineer / Enterprise Continuous Integration Engineer (contract)",
            "highlights": [
                "Work closely with the university to implement a new back-end system and systems to implement as policies in and new build.",
                "led development of applications",
                "creating core components"
            ]
        }
    ]
}