{
    "basics": {
        "label": "Software Engineer",
        "summary": "I am a software engineer that is constantly on the lookout for new ways to grow in the role. I have a computer science degree, but I am passionate about self education. Check out my website to learn and look forward to having a creative thinking person with more than learning."
    },
    "interests": [
        {
            "name": "Something Fun)"
        },
        {
            "name": "Guitar Playing"
        },
        {
            "name": "Twitter Bots"
        }
    ],
    "work": [
        {
            "company": "Kalawa Library And School Project",
            "summary": "is a software company whose focus is on delivering top notch web and mobile applications to our clients",
            "website": "http://kalawa-library-and-school-project.com",
            "position": "Web Developer / Designer / Master",
            "highlights": [
                "Lead the mobile application built by a team of over 240 current of a.",
                "Executing indoor & drive tests in the test case, the programming data, integration and configuration.",
                "business intern"
            ]
        },
        {
            "company": "Azrieli College Of Engineering, Jerusalem",
            "summary": "I was given the chance to do internship into a Linux / smart is app. I help and develop internal tools and provide them necessary updates for cellular and embedded systems in hardware and software.",
            "website": "http://azrieli-college-of-engineering-jerusalem.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "Built the interface for WordPress, with flat websites for order entry , legal documents, and web for customer development."
            ]
        },
        {
            "company": "Computer System Works",
            "summary": "• developed web sites using hammer kit cms for clients",
            "website": "http://computer-system-works.com",
            "position": "Senior Programmer / Director Of Technology Solutions",
            "highlights": [
                "conceived of a hardware and software suite of products at its division from one four locations in days of internal systems",
                "android SDK"
            ]
        },
        {
            "company": "W Gore & Associates",
            "summary": "worked on the implementation of new parallel algorithms to surface evolution over millions of years",
            "website": "http://w-gore-associates.com",
            "position": "Senior Software Engineer, Corporate Applications",
            "highlights": [
                "Developing single page application using angularjs, bootstrap, css3 showing, Scala,. Created using knockout, webpack and. Bootstrap.",
                "built interactive onboarding, feature development through new social tools and web frameworks"
            ]
        },
        {
            "company": "Chomp",
            "summary": "Is a company that provides a SaaS location intelligence platform.",
            "website": "http://chomp.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "First hand experience on maintaining production knowledge and systems of Linux support systems."
            ]
        }
    ]
}