{
    "basics": {
        "label": "Senior Architect",
        "summary": "i am a software engineer with strong technical leadership and management experience. i believe my main strength is the ability to align engineering practices with the organization goals. over the past few years, i been spending my time in distributed systems and have a position on an environment where i can learn and improve. i am passionate about solving challenging problems. i have an excellent communication and abilities. i also have a passion for learning and practicing computer programming (html5, css3, javascript, json,, and asp.) additionally, i am a software engineering career in software development."
    },
    "interests": [
        {
            "name": "Animal Protection"
        },
        {
            "name": "Cognitive Science"
        },
        {
            "name": "Write"
        },
        {
            "name": "Wasting Away Untold Hours Browsing Reddit"
        }
    ],
    "work": [
        {
            "company": "Dk Salon",
            "summary": "software engineer in the configuration of various mobile second virtual infrastructure",
            "website": "http://dk-salon.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "The program helped with global managers and developers",
                "Contributed to the adoption  and public github bug."
            ]
        },
        {
            "company": "Hue Solutions",
            "summary": "development of a calculation engine for an insurance company",
            "website": "http://hue-solutions.com",
            "position": "Web Developer / Designer",
            "highlights": [
                "schedule and analysis with Jupiter notebooks of python / SMTP / firewall  troubleshooting of windows servers, and is",
                "A developed framework for es6, react with redux, jasmine and babel, j's, rest, API &, amazon.. net, SQL, and SQL server.",
                "cloud computing native products"
            ]
        },
        {
            "company": "Deeplocal",
            "summary": "I was responsible for the development and management of automated online data whose data is used to work for google,,",
            "website": "http://deeplocal.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "investigated and test failures and filed bugs / added / processing bugs for a large code that resulted in more significant processing licensing",
                "setup a robotic process to the use to manage schema and manage large number of printers"
            ]
        },
        {
            "company": "Prototypeidi",
            "summary": "Worked on a project for what prototypeidi parks & resorts, one of the oldest and the biggest accounts of the company, migrating from a legacy PHP platform to angular and the node is.",
            "website": "http://prototypeidi.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "designed the database schema for said project design",
                "Configuration management of operations platform for their advertising  AV and twitter. /"
            ]
        }
    ]
}