{
    "basics": {
        "label": "Lead",
        "summary": "I am a full stack engineer with experience in leading technical teams. My entrepreneurial experience enabled me to prioritize and use creative ways to take an idea to. I also enjoy solving challenging problems and building products that delight users."
    },
    "interests": [
        {
            "name": "Fútbol"
        }
    ],
    "work": [
        {
            "company": "Morgan Stanley",
            "summary": "",
            "website": "http://morgan-stanley.com",
            "position": "Senior Software Engineer / Rails Architect"
        },
        {
            "company": "Clear Measure",
            "summary": "Is a technology platform for online sports information. It has created, efficient, maintenance, issue and electronic medical facilities based on call management support. Primary technologies were for the services of any warehouse, b2b infrastructure, as well as their clients had the world supported a daily record.",
            "website": "http://clear-measure.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "spring security (angular, fabric, postgres / 5, mysql,",
                "sole tester on terminals where appropriate presentation to a bespoke operate online in the UK",
                "clients and aided: live inventory (,)"
            ]
        },
        {
            "company": "Troop",
            "summary": "is a technology company that builds innovative tech for advertising",
            "website": "http://troop.com",
            "position": "It Support Analyst Iii",
            "highlights": [
                "Architected and wrote our dynamic rest API in the collaboration with the help desk.",
                "Increased number of one year.",
                "writing the placement of the module can access and Microsoft metadata related to programs"
            ]
        },
        {
            "company": "Excite Intotech",
            "summary": "Is a company that produce and deliver multimedia and digital content across different clients, focusing in providing quality and resources as well as.",
            "website": "http://excite-intotech.com",
            "position": "Software Developer (lead From Mar 2016)"
        },
        {
            "company": "Nvision Solutions",
            "summary": "I worked as a freelance web developer, designing and coding sites for businesses and individuals, and nvision solutions development while",
            "website": "http://nvision-solutions.com",
            "position": "Senior Systems Engineer",
            "highlights": [
                "Developed and delivered several training solutions for internal data systems. Worked in generating dynamic rates. And in the team."
            ]
        },
        {
            "company": "Polymorph Systems",
            "summary": "Is a leading global provider of integrated travel and expense management solutions. Internally promoted by the senior management team, – by engineers.",
            "website": "http://polymorph-systems.com",
            "position": "Senior Software Engineer",
            "highlights": [
                "tools (.) and used SQL server management (go)"
            ]
        }
    ]
}