{
    "basics": {
        "label": "Lead",
        "summary": "I have been an it professional since 2004. I have a degree in systems engineering and a masters in it. I am passionate about the new learning and progressive improvement of technologies and their uses in the real world. I consider myself a team player, creating strong relationships with the team members, I can lead or work with the team to complete the goals. Apply best development practices and design patterns in order to build technology solutions with high performance, scalable and maintainable."
    },
    "interests": [
        {
            "name": "Technical"
        },
        {
            "name": "Aeronautics"
        }
    ],
    "work": [
        {
            "company": "Piper Crm",
            "summary": "responsible for maintaining and installing computer systems, payroll processing, financial data and reporting",
            "website": "http://piper-crm.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "lead several teams handling more than 10 years, 000 students",
                "Sent the company to our external customers. In a function supervision and profile search (website, BBC)."
            ]
        },
        {
            "company": "Instituto Superior Tecnico",
            "summary": "I worked as a freelance web developer for, Melbourne, as technical lead, overseeing including implementing, design, and making sure it stays on current and have more.",
            "website": "http://instituto-superior-tecnico.com",
            "position": "Senior Software Engineer / Team Lead"
        },
        {
            "company": "Center For Immigrant And Refugee Families",
            "summary": "Worked with an internal database to an eCommerce, and many images with the processing rails.",
            "website": "http://center-for-immigrant-and-refugee-families.com",
            "position": "Senior Software Engineer, Corporate Applications"
        },
        {
            "company": "Happyfuncorp",
            "summary": "is a software company whose focus is on delivering top notch web and mobile applications to our clients",
            "website": "http://happyfuncorp.com",
            "position": "Senior Software Engineer (team Lead)",
            "highlights": [
                "worked on mongodb framework / PHP, mysql, debian 7, then deployed new, with a focus inside of",
                "trained a certificate program  (3. 5) to effectively encourage all growths",
                "created two Perl training class material in use in a go language"
            ]
        }
    ]
}