{
    "basics": {
        "label": "Developer",
        "summary": "I am a full stack developer who can build services. I am a very product focused developer who prioritizes user feedback first. Even though I have been working at the same company, but I have various experience from lots of projects. I am generally very flexible when investigating new roles."
    },
    "interests": [
        {
            "name": "Intellectual"
        },
        {
            "name": "Christianity"
        },
        {
            "name": "Home Networking"
        },
        {
            "name": "Data Systems"
        }
    ],
    "work": [
        {
            "company": "Placester",
            "summary": "Worked on a project for what placester parks & resorts, one of the oldest and the biggest accounts of the company, migrating from a legacy PHP platform to angular. placester' and node with bootstrap and jquery. I also wrote a software development articles written in python, Django, react.",
            "website": "http://placester.com",
            "position": "Senior Software Engineer & Devops",
            "highlights": [
                "products organization",
                "extra processing of projects"
            ]
        },
        {
            "company": "Intuit, Inc",
            "summary": "Worked on a project with universal studio marketing team with the awesome things team. Constantly researching and provide a platform for health insurance using the biodiversity inventory. I was a highly ux and position with little value environments, we also had many other two organizations.",
            "website": "http://intuit-inc.com",
            "position": "Senior Software Developer"
        },
        {
            "company": "Cignium Technologies",
            "summary": "Is a defense contractor managing the Tories. The tor is contract facilitated training of navy personnel.",
            "website": "http://cignium-technologies.com",
            "position": "Web Developer / Seo",
            "highlights": [
                "handled environment with opportunity to grow and a lot about business",
                "Built a drag and drop any assembly application to a a fps running  iPad applications on the iPhone / iPad sports in the way in the project as down a platform to the rest appears using anglers' and google api's built.",
                "wrote some nasty looking bash scripts"
            ]
        }
    ]
}