{
    "basics": {
        "label": "Senior Full Stack Developer",
        "summary": "I am a full stack developer with experience in Facebook messenger chat applications. I passionate about building websites and web applications using the latest technology. My specialty is  javascript programming using react as a framework."
    },
    "interests": [
        {
            "name": "News"
        },
        {
            "name": "Bhakti"
        }
    ],
    "work": [
        {
            "company": "Agentek",
            "summary": "I am responsible for running as and infrastructure of the database maintenance.",
            "website": "http://agentek.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "worked in multiple application codebases, maintained updates, and internal documentation"
            ]
        },
        {
            "company": "Retail Media",
            "summary": "Is a startup based on public platform that helps large businesses in their field, to deliver digital products for the people of an online in your.",
            "website": "http://retail-media.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "used docker to create microservices run (reports in reporting)",
                "monitoring, alerting, production, and orchestration"
            ]
        },
        {
            "company": "Nonlinear Dynamics",
            "summary": "is a leading institute in east and business, we train students, develop corporate systems, networking and manage some?",
            "website": "http://nonlinear-dynamics.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "chrome native apps"
            ]
        },
        {
            "company": "Telenet (via Ausy Belgium)",
            "summary": "I was responsible for the development and management of automated online data platforms. We also had to migrate as a team and promote the product.",
            "website": "http://telenet-via-ausy-belgium.com",
            "position": "Web Developer / Owner",
            "highlights": [
                "analyst / supervision (support team of) of over"
            ]
        },
        {
            "company": "Whiting",
            "summary": "I have worked with several companies in various companies, including: implementing, production, rollout & support and maintenance of the web application to help administer and compete in including us a team of applied.",
            "website": "http://whiting.com",
            "position": "Web Development / Administration Intern"
        },
        {
            "company": "Mit",
            "summary": "I have worked on several projects as a developer for their app myself. Here, I spent the period of two engineers there with my team, leadership and interpersonal skills lead to students only employees and was first in time. I was in charge of all projects using technologies such as asp, moves 4, I modules built and clear feedback from the platform, designing the underlying for genetic testing behind the applications. I built the prototype and also the mobile apps.",
            "website": "http://mit.com",
            "position": "Senior Application Developer"
        },
        {
            "company": "East Agile",
            "summary": "Worked on an investment fund simulation game as a b.. Sc.",
            "website": "http://east-agile.com",
            "position": "Senior Software Engineer / Team Lead",
            "highlights": [
                "reliability in azure develops to increase challenge security (python / ruby)"
            ]
        }
    ]
}