{"title":"The job market feels more competitive than ever.","intro":{"content":[{"text":"Human missteps that may once have been dismissed by human forgiveness may now automatically dispatch a computer-generated rejection to your inbox. Did you comment in defense of a Jeff Dunham video back in 2009? You might be flagged as having antisocial tendencies. Did you accidentally use the British spelling of “conceptualize” on your CV? You’re illiterate. Your participation in a quirky Brainfuck hack-a-thon might put you on a black list for abusive language."},{"text":"When an estimated §70% of job applications are automatically rejected by applicant tracking systems (ATS)§https://jobs.theguardian.com/article/how-to-optimise-your-cv-with-key-words/§ and §companies are screening out applicants based on their social media habits§https://yougov.co.uk/topics/politics/articles-reports/2017/04/10/disgracebook-one-five-employers-have-turned-down-c§, it can seem like technology is up against you.","link":"§"},{"text":"That's because it is. Well, most of it anyway. At deepwork, our software works for you, so you can work. Period."},{"text":"With our cutting-edge technology, you’ll be more than just another statistic. We are able to algorithmically alter your digital DNA, from your overwrought resume down to your Zoom-fatigued face, turning you into something that’s proven to resonate more powerfully with employers, recruiting agencies, and the state-of-the-art ATS they use. And with Klarna, you can pay later. You know, when you can afford it."}]},"resume":{"title":"Resume Atelier","subtitle":"Grammarly can't save your garbage resume. Experience can.","lead":[{"text":"Unfortunately, as far back as 2014, §journalists and academics§https://www.wsj.com/articles/want-an-entry-level-job-youll-need-lots-of-experience-1407267498§ have noted the emergence of an industry-standard paradox of requiring two or more years of relevant work experience for an entry-level job. If you don't have the social connections to make the right introductions (you don't) and can't afford to both intern and eat for the next half decade, then it’s time to invest in a better future with our Resume Atelier. Student loan repayments be damned.","link":"§"}],"instructions":[{"text":"Explore samples of our STEMsational real fake resumes in our product demo here. Simply use the dropdown menu to select your aspirational level of experience and pivot your way to success!"}],"content":[{"text":"Using cutting-edge neural network technology trained on thousands of resumes, deepwork can generate a brand new resume for you in your field of choice."},{"text":"Some of the entries don’t make sense? Don’t worry: Recruiters don’t know the difference. Sign up to create a plagiarism bot-beating one-of-a-kind resume that represents your value as a worker better than your achingly sincere cover letter ever could."}]},"photo":{"title":"Profile Picture Studio","subtitle":"Grow up, glow up, or man up your profile picture game.","lead":[{"text":"You’re not the only one job hunting right now, and §as long as looks continue to influence hirings and salaries§https://www.theguardian.com/society/2020/jul/28/eight-people-claiming-employment-support-for-every-vacancy-says-thinktank§, you’ll need all the help you can get.","link":"§"},{"text":"Today’s LinkedIn profile photo is what a firm handshake was thirty years ago: A totally arbitrary signifier of your entire worth as a professional. You might be able to Facetune that zit away but making your LinkedIn picture recruiter-ready might be a little more complicated. If you’re §too young§https://www.bbc.com/worklife/article/20210730-the-acute-ageism-problem-hurting-young-workers§, §too old§https://www.ft.com/content/e4141576-04eb-11e9-99df-6183d3002ee1§, §too ugly§https://hbr.org/2019/10/attractive-people-get-unfair-advantages-at-work-ai-can-help§, §too female§https://www.independent.co.uk/news/uk/home-news/sexism-work-female-bosses-young-women-trust-pay-gender-gap-a8965681.html§—you might just stay too underemployed.","link":"§"}],"instructions":[{"text":"Play with the sliders on any of our models to get an idea of how you could grow up, glow up, or man up your own photos."}],"content":[{"text":"Luckily, with deepwork’s Profile Picture Studio, you can alter photos of yourself to be younger, hotter, or more masculine. The resulting photo will still be you, just a you that looks a bit more suitable for an “About Us” page."},{"text":"Unfortunately, deepwork is plagued by §the same technical failings§https://www.theguardian.com/technology/2016/sep/08/artificial-intelligence-beauty-contest-doesnt-like-black-people§ as many other tech giants in that its filters often equate whiteness with beauty. This doesn’t represent true beauty or our beliefs. Until we fix our software, our filters can at least give you that special glow seen only on certain LinkedIn influencers and Panera bread ads.","link":"§"}]},"photo-b":{"lead":[{"text":"Not all biases are so easy to place. Like class, for instance. Maybe your look says “Bud Light Platinum” more than it says “Moët & Chandon Réserve Impériale.” We can improve your odds of being a good company “fit” by combining your profile picture with various stock photo models from our library."}],"instructions":[{"text":"Use the controls to blend two photos together."}],"content":[{"text":"If this feels like a gross intrusion on one of the most basic representations of who you are as an individual, remember: Nothing personifies the great melting pot of corporate culture like a stock photo."},{"text":"As an added benefit, using deepwork to alter your appearance will make it less likely for potential employers to conclusively recognize you on your other social media, just in case you forgot to delete that cinnamon challenge video."}]},"thought-leadership":{"title":"Thought Leadership Package","subtitle":"At a certain point in your career, you’ll want to signal to potential employers that you’re ready to take on more responsibility (and a higher paycheck).","lead":[{"text":"The best way to showcase your suitability for a higher-ranking position is via an elaborate mating ritual known as Thought Leadership."},{"text":"Thought Leadership refers to the production of materials on social media or personal blogs with the sole purpose of demonstrating how well your personality can conform to a specific corporate aesthetic. For Thought Leadership to be successful, its creator must walk a fine line: Demonstrate a thorough immersion in corporate culture—think soundbite-ready non-opinions like “It’s now more essential than ever that moms understand the environmental impacts of big data All businesses are blockchain ready, it’s the employees who aren’t”—while sharing a few relatable work-appropriate interests (like cycling or kite surfing) to maintain the illusion of personhood."}],"instructions":[{"text":"Try out our technology by combining Tweets from some of our favourite (but not affiliated) idealogues."}],"content":[{"text":"Performative pandering to an unknown audience not your cup of tea? That’s true for everyone. But §recruiters and employers§https://hbr.org/2021/09/stop-screening-job-candidates-social-media§ are looking at your social media whether you like it or not, so you might as well put on a good show. As a relatively new concept, it’s hard to quantify the impact thought leadership has on your career trajectory. We’re not above invoking career advice iconoclasts like §Askmen.com§https://www.askmen.com/career_money/career/how-to-use-thought-leadership-to-get-you-a-raise.html§ or §DHL§https://www.dhl.com/discover/en-global/business/finding-new-customers/how-to-boost-your-business§ to convince you that you need to become a Thought Leader today.","link":"§"},{"text":"Demonstrating Thought Leadership on your social media can be daunting, especially for first-timers who may be led astray by the misconception that the term inherits any meaning from either of its component words. If that sounds like you, deepwork’s Thought Leadership package lets you stand on the shoulders of some of the most influential egos in your field."},{"text":"Head to our product page to explore pricing for our one-time service, as well as our subscription packages that support weekly, daily, hourly, and quarter hourly posting. If you’re feeling bold, signing up for our package will allow you to throw your own social media handle into the mix to hybridize your own thoughts with objectively more successful people."}]},"video-call":{"title":"Video Conferencing Plug-in","subtitle":"When opportunity calls, don’t be afraid to pick up.","lead":[{"text":"Though deepwork can’t help you with technical interviews (§take a look at CoPilot for that§https://copilot.github.com/§), we can help you make a more professional first impression in your Zoom interviews. (If the concept of a late-stage interview is foreign to you, consider our Resume Atelier and Profile Picture Studio.)","link":"§"},{"text":"Our Video Conferencing Plug-in package uses all the same looks optimization technology available in our Profile Picture Studio package, but takes it to the next level by letting you assume your avatar’s much more hirable appearance for video calls."}],"instructions":[{"text":"You can preview our video generation process here, and watch your chosen face act out expressions such as “Thoughtful consideration,” “You know what, that’s a great idea, sir,” and, “Gen Z, what are you gonna do?”"}],"content":[{"text":"Our technique utilizes something experts call the §First-order Motion Model§https://aliaksandrsiarohin.github.io/first-order-model-website/§ method, which is widely associated with so-called “deepfake” technology. But don’t let media pundits and their pretty privilege put you off—what’s fake about your commitment to attaining meaningful employment at any cost?","link":"§"},{"text":"With the rising popularity of flexible work arrangements, we’ve responded to intense customer demand by expanding our subscription services for longer term packages! After you score that dream role, there’s no reason to spoil the fantasy. As long as you’re WFH, your coworkers will never have to know you’re a sweaty, poorly lit, recent grad and/or ugly."}]},"outro":{"title":"Ready to deepwork?","content":[{"text":"deepwork is trusted by hundreds of thousands of underemployed, underpaid and underappreciated individuals to solve at least that first problem. Who knows? You might have a deepworker in your LinkedIn network already."},{"text":"Don’t believe our technology can help you unlock your true earning potential? Listen to what our customers have to say about deepwork."}]},"outrol":{"lead":[{"text":"You’ve already done the hard part of lowering your job-search standards from “meaningful work” to  “whatever will pay the bills.”"},{"text":"Let us do the rest."}]},"reviews":[{"title":"An absolute breeze to onboard!","content":"I was initially a bit morally conflicted about deepwork, but their onboarding was so seamless, I barely had time to think about it!","author":"Fatima","location":"London, UK"},{"title":"deepwork gets it","content":"FINALLY! A company that acknowledges that getting hired in the 2020s is a dog-eat-dog world. deepwork is like giving a mecha suit to a chihuahua.","author":"Brenda","location":"Toronto, Canada"},{"title":"Doubled my earnings","content":"Being a man in the e-romance business has always put me at a bit of a disadvantage. But with deepwork, I’ll have enough money for my “passport and plane ticket over” very soon.","author":"“BrianAlyssa”","location":"Detroit, USA"},{"title":"A breath of fresh air","content":"Most businesses work best when they can replace a malfunctioning cog as easily as ordering a spare part from an Ikea catalogue. The fact that you're a unique human being doesn't even factor in. Stop playing their games and get deepwork.","author":"Aaron","location":"Chicago, USA"}]}